[
  {
    "date": "April 1, 2020",
    "text": "In collaboration with Asociaţia Medicală Română de Biomodelare 3D and Societatea Studenților în Medicină din București (SSMB), we are currently 3D-printing face shields in order to help our doctors to stay protected. The printing process is happening in the Carol Davila University of Medicine and Pharmacy in Bucharest and we need as many volunteers as possible to help us speeding things up.",
    "img": "https://i.imgur.com/yZ8OIqx.png"
  },
  {
    "date": "March 12, 2020",
    "text": "We are sorry to announce that we will no longer participate in the Copernicus programme- Eyes on Earth Roadshow that was supposed to be held in Bucharest on 24-25th of March 2020 due to the actions taken by the Romanian authorities to mitigate the spread of the COVID 19 virus.",
    "img": "https://i.imgur.com/stAaRYQ.jpg"
  },
  {
    "date": "February 15, 2020",
    "text": "The Student Training Week is over. After a week of training and after our PDR , we are motivated to keep working on our experiment. In June, the REXUS teams will meet again for the Critical Design Review in Germany.",
    "img": "https://i.imgur.com/5JvddJl.jpg"
  },
  {
    "date": "February 14, 2020",
    "text": "Our last day in Sweden. The REXUS/BEXUS teams visited The Ice Hotel from Kiruna. Also, on day 3, we visited the visitors center and we did a quick tour of the rocket launch base. Tomorrow we'll be heading back to Romania and we will continue our work.",
    "img": "https://i.imgur.com/TMTL07A.jpg"
  },
  {
    "date": "December 19, 2019",
    "text": "The Romanian Space Agency (ROSA) has published an article on their website and Facebook page about us. We thank them very much and we hope that our project will inspire many students passioned about space and technology.",
    "url": "http://rosa.ro/index.php/en/news-menu/stiri/4015-experiment-in-printarea-3d-al-unor-studenti-romani-selectat-pentru-testarea-in-spatiu",
    "buttonText": "Read the article"
  },
  {
    "date": "December 9, 2019",
    "img": "https://i.imgur.com/NIDiz4e.jpg",
    "text": "Team ECRIDA has been accepted to join the REXUS/BEXUS 13th cycle and to fly their experiment in the REXUS 29 sounding rocket. The 29th rocket will be launched in March 2021 from Kiruna, Sweden. 🇸🇪🚀"
  },
  {
    "date": "November 2019",
    "text": "We were invited to the Netherlands to present our project at the final selection of the competition in front of a panel of experts from DLR, ESA, MORABA, SNSA and ZARM, along with other 15 European teams.",
    "img": "https://i.imgur.com/hEI9oWU.jpg"
  },
  {
    "date": "October 2019",
    "text": "We found out that our experiment was selected and accepted for the final selection from over 100 experiments proposed by top universities from all over Europe."
  },
  {
    "date": "September 2019",
    "text": "We began to translate our idea into a proposal that we sent to the European Space Agency."
  }
]
